Tekla Open API Reference for Tekla Structures 2025
DataGrid Class
 The DataGrid class represents a data grid control that can contain images.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.DataGridView
 Tekla.Structures.Dialog.UIControls.DataGrid
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class DataGrid : DataGridView
Public Class DataGrid
	Inherits DataGridView
The DataGrid type exposes the following members.
Constructors
Name | Description
DataGrid
 Initializes a new instance of the DataGrid class.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace